# WorksetPreview Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
WorksetPreview Members
WorksetPreview Class Methods Properties See Also
---
The WorksetPreview type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the WorksetPreview |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | Id of the workset. |
| IsDefaultWorkset | Whether the workset is the default one. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | Name of the workset. |
| Owner | User name of the workset. |
| UniqueId | UniqueId of the workset. |

# See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace